package dami.programmers;

public class Programmers {
	public void solutions() {
		//////////////////////////////////////////////////////////////////////////////
		/*                              level2                                      */
		//new 멀쩡한_사각형().solution(100000000, 100000001);
		//new 일이사_나라의_숫자().solution(20);
		//new 기능개발().solution(new int[] {93, 30, 55}, new int[] {1, 30, 5});
		//new 카카오프렌즈_컬러링북().solution(6, 4, new int[][] {{1, 1, 1, 0}, {1, 2, 2, 0}, {1, 0, 0, 1}, {0, 0, 0, 1}, {0, 0, 0, 3}, {0, 0, 0, 3}});
		//new 문자열_압축().solution("abcabcdede");
		//new 삼각_달팽이().solution(4);
		//new 조이스틱().solution("JEROEN");
		//new 소수찾기().solution("1234");
		//new 타겟_넘버().solution(new int[] {2, 3, 5, 7, 9}, 8);
		//new 가장_큰_정사각형_찾기().solution(new int[][]{{0,1,1,1},{1,1,1,1},{1,1,1,1},{0,0,1,0}});
		//new 땅따먹기().solution(new int[][]{{1, 2, 3, 5}, {5, 6, 7, 100}, {4, 3, 2, 1}});
		//new 폰켓몬().solution(new int[] {3, 3, 3, 2, 2, 4});
		//new 튜플().solution("{{4,2,3},{3},{2,3,4,1},{2,3}}");
		//new 수식_최대화().solution("100-200*300-500+20");
		//new 짝지어_제거하기().solution("cdcd");
		//new 더_맵게().solution(new int[] {1, 2, 3, 9, 10, 12}, 7);
		//new 이진_변환_반복하기().solution("01110");
		//new 압축().solution("ABABABABABABABAB");
		//////////////////////////////////////////////////////////////////////////////

		//////////////////////////////////////////////////////////////////////////////
		/*                              level3                                      */
		//new 정수_삼각형().solution(new int[][] {{7}, {3, 8}, {8, 1, 0}, {2, 7, 4, 4}, {4, 5, 2, 6, 5}});
		//////////////////////////////////////////////////////////////////////////////
	}
}
